## Commits guideline

Мы придерживаемся [Соглашения о коммитах](https://www.conventionalcommits.org/ru/v1.0.0-beta.4/).

Название коммита должно отвечать на вопрос "Что делает?".

Например:

```
fix: Исправляет вывод данных
```

Мы используем следующие типы коммитов:

-   `feat`: Новая фича

-   `impr`: Улучшение существующей фичи

-   `fix`: Исправление бага

-   `docs`: Изменения документации

-   `style`: Изменения не влияющие на сам код (пробелы, форматирование, точки с запятой, и так далее)

-   `refactor`: Изменения в коде, который ничего не исправляют и не добавляют фичи, но делают код легче для чтения, понимания или улучшают

-   `perf`: Улучшения производительности кода

-   `test`: Изменения, затрагивающие тесты

-   `build`: Изменения, затрагивающие сборку или внешние зависимости (примеры контекстов: gulp, broccoli, npm)

-   `ci`: Изменения в конфигурационных файлах и скриптах CI

-   `revert`: Отмена предыдущего коммита

-   `chore`: Другие изменения не подходящие ни к чему выше

Также мы придерживаемся [методологии GitFlow](https://nvie.com/posts/a-successful-git-branching-model/)
